In [1]:
import pandas as pd 
import numpy as np

In [2]:
index_val = [('cse',2019),('cse',2020),('cse',2021),('cse',2022),('ece',2019),('ece',2020),('ece',2021),('ece',2022)]

In [3]:
a = pd.Series([1,2,3,4,5,6,7,8],index = index_val)
a

(cse, 2019)    1
(cse, 2020)    2
(cse, 2021)    3
(cse, 2022)    4
(ece, 2019)    5
(ece, 2020)    6
(ece, 2021)    7
(ece, 2022)    8
dtype: int64

In [4]:
a['cse']

KeyError: 'cse'

In [35]:
index_val = [('cse',2019),('cse',2020),('cse',2021),('cse',2022),('ece',2019),('ece',2020),('ece',2021),('ece',2022)]

In [36]:
multiindex = pd.MultiIndex.from_tuples(index_val)

In [37]:
multiindex.levels[0]

Index(['cse', 'ece'], dtype='object')

In [8]:
pd.MultiIndex.from_product([['cse','ece'],[2019,2020,2021,2022]]).levels[1]

Int64Index([2019, 2020, 2021, 2022], dtype='int64')

In [9]:
s = pd.Series([1,2,3,4,5,6],index=multiindex)
s

cse  2019    1
     2020    2
     2022    3
ece  2019    4
     2020    5
     2021    6
dtype: int64

In [10]:
s['cse']

2019    1
2020    2
2022    3
dtype: int64

In [11]:
s

cse  2019    1
     2020    2
     2022    3
ece  2019    4
     2020    5
     2021    6
dtype: int64

In [12]:
temp = s.unstack()
temp

     2019  2020  2021  2022
cse   1.0   2.0   NaN   3.0
ece   4.0   5.0   6.0   NaN

In [13]:
temp.stack()

cse  2019    1.0
     2020    2.0
     2022    3.0
ece  2019    4.0
     2020    5.0
     2021    6.0
dtype: float64

In [14]:
branch_df1 = pd.DataFrame([[1,2],[3,4],[5,6],[7,8],[9,10],[11,12]],index=multiindex,columns=['x','y'])

In [15]:
branch_df1

           x   y
cse 2019   1   2
    2020   3   4
    2022   5   6
ece 2019   7   8
    2020   9  10
    2021  11  12

In [16]:
branch_df1[['x','y']]

           x   y
cse 2019   1   2
    2020   3   4
    2022   5   6
ece 2019   7   8
    2020   9  10
    2021  11  12

In [17]:
branch_df2 = pd.DataFrame([
    [1,2,0,0],
    [3,4,0,0],
    [5,6,0,0],
    [7,8,0,0],
],index = [2019,2020,2021,2022],columns = pd.MultiIndex.from_product([['delhi','mumbai'],['avg_package','students']])
)

In [18]:
branch_df2

           delhi               mumbai
     avg_package students avg_package students
2019           1        2           0        0
2020           3        4           0        0
2021           5        6           0        0
2022           7        8           0        0

In [19]:
branch_df2.loc[2019]

delhi   avg_package    1
        students       2
mumbai  avg_package    0
        students       0
Name: 2019, dtype: int64

In [20]:
branch_df2.iloc[0:2,0:3]

           delhi               mumbai
     avg_package students avg_package
2019           1        2           0
2020           3        4           0

In [21]:
branch_df2['delhi']

      avg_package  students
2019            1         2
2020            3         4
2021            5         6
2022            7         8

In [38]:
multiindex

MultiIndex([('cse', 2019),
            ('cse', 2020),
            ('cse', 2021),
            ('cse', 2022),
            ('ece', 2019),
            ('ece', 2020),
            ('ece', 2021),
            ('ece', 2022)],
           )

In [39]:
branch_df3 = pd.DataFrame(
    [
        [1,2,0,0],
        [3,4,0,0],
        [5,6,0,0],[7,8,0,0],[9,10,0,0],[11,12,0,0],[13,14,0,0],[15,16,0,0],
        

    ],
    index = multiindex,
    columns = pd.MultiIndex.from_product([['delhi','mumbai'],['avg_package','students']])
)

In [40]:
branch_df3

               delhi               mumbai
         avg_package students avg_package students
cse 2019           1        2           0        0
    2020           3        4           0        0
    2021           5        6           0        0
    2022           7        8           0        0
ece 2019           9       10           0        0
    2020          11       12           0        0
    2021          13       14           0        0
    2022          15       16           0        0

In [44]:
branch_df3.stack().stack()

cse  2019  avg_package  delhi      1
                        mumbai     0
           students     delhi      2
                        mumbai     0
     2020  avg_package  delhi      3
                        mumbai     0
           students     delhi      4
                        mumbai     0
     2021  avg_package  delhi      5
                        mumbai     0
           students     delhi      6
                        mumbai     0
     2022  avg_package  delhi      7
                        mumbai     0
           students     delhi      8
                        mumbai     0
ece  2019  avg_package  delhi      9
                        mumbai     0
           students     delhi     10
                        mumbai     0
     2020  avg_package  delhi     11
                        mumbai     0
           students     delhi     12
                        mumbai     0
     2021  avg_package  delhi     13
                        mumbai     0
           students     delhi     14
                        mumbai     0
     2022  avg_package  delhi     15
                        mumbai     0
           students     delhi     16
                        mumbai     0
dtype: int64

In [45]:
branch_df3.head()

               delhi               mumbai
         avg_package students avg_package students
cse 2019           1        2           0        0
    2020           3        4           0        0
    2021           5        6           0        0
    2022           7        8           0        0
ece 2019           9       10           0        0

In [47]:
branch_df3.shape

(8, 4)

In [48]:
branch_df3.info()

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 8 entries, ('cse', 2019) to ('ece', 2022)
Data columns (total 4 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   (delhi, avg_package)   8 non-null      int64
 1   (delhi, students)      8 non-null      int64
 2   (mumbai, avg_package)  8 non-null      int64
 3   (mumbai, students)     8 non-null      int64
dtypes: int64(4)
memory usage: 632.0+ bytes

In [49]:
branch_df3.duplicated()

cse  2019    False
     2020    False
     2021    False
     2022    False
ece  2019    False
     2020    False
     2021    False
     2022    False
dtype: bool

In [50]:
branch_df3.isnull()

               delhi               mumbai
         avg_package students avg_package students
cse 2019       False    False       False    False
    2020       False    False       False    False
    2021       False    False       False    False
    2022       False    False       False    False
ece 2019       False    False       False    False
    2020       False    False       False    False
    2021       False    False       False    False
    2022       False    False       False    False

In [52]:
branch_df3

               delhi               mumbai
         avg_package students avg_package students
cse 2019           1        2           0        0
    2020           3        4           0        0
    2021           5        6           0        0
    2022           7        8           0        0
ece 2019           9       10           0        0
    2020          11       12           0        0
    2021          13       14           0        0
    2022          15       16           0        0

In [51]:
branch_df3.loc[('cse',2022)]

delhi   avg_package    7
        students       8
mumbai  avg_package    0
        students       0
Name: (cse, 2022), dtype: int64

In [56]:
branch_df3.loc[('cse',2019):('ece',2020):2]

               delhi               mumbai
         avg_package students avg_package students
cse 2019           1        2           0        0
    2021           5        6           0        0
ece 2019           9       10           0        0

In [57]:
branch_df3.iloc[0:5:2]

               delhi               mumbai
         avg_package students avg_package students
cse 2019           1        2           0        0
    2021           5        6           0        0
ece 2019           9       10           0        0

In [59]:
branch_df3['delhi']['students']

cse  2019     2
     2020     4
     2021     6
     2022     8
ece  2019    10
     2020    12
     2021    14
     2022    16
Name: students, dtype: int64

In [60]:
branch_df3

               delhi               mumbai
         avg_package students avg_package students
cse 2019           1        2           0        0
    2020           3        4           0        0
    2021           5        6           0        0
    2022           7        8           0        0
ece 2019           9       10           0        0
    2020          11       12           0        0
    2021          13       14           0        0
    2022          15       16           0        0

In [64]:
branch_df3.iloc[0:4,0:3]

               delhi               mumbai
         avg_package students avg_package
cse 2019           1        2           0
    2020           3        4           0
    2021           5        6           0
    2022           7        8           0

In [66]:
branch_df3.iloc[[0,4],[1,2]]

            delhi      mumbai
         students avg_package
cse 2019        2           0
ece 2019       10           0

In [75]:
branch_df3.sort_index(ascending=[True,True])

               delhi               mumbai
         avg_package students avg_package students
cse 2019           1        2           0        0
    2020           3        4           0        0
    2021           5        6           0        0
    2022           7        8           0        0
ece 2019           9       10           0        0
    2020          11       12           0        0
    2021          13       14           0        0
    2022          15       16           0        0

In [83]:
branch_df3.sort_index(level=1, ascending=True)

               delhi               mumbai
         avg_package students avg_package students
cse 2019           1        2           0        0
ece 2019           9       10           0        0
cse 2020           3        4           0        0
ece 2020          11       12           0        0
cse 2021           5        6           0        0
ece 2021          13       14           0        0
cse 2022           7        8           0        0
ece 2022          15       16           0        0

In [84]:
branch_df3

               delhi               mumbai
         avg_package students avg_package students
cse 2019           1        2           0        0
    2020           3        4           0        0
    2021           5        6           0        0
    2022           7        8           0        0
ece 2019           9       10           0        0
    2020          11       12           0        0
    2021          13       14           0        0
    2022          15       16           0        0

In [85]:
branch_df3.transpose()

                    cse                 ece
                   2019 2020 2021 2022 2019 2020 2021 2022
delhi  avg_package    1    3    5    7    9   11   13   15
       students       2    4    6    8   10   12   14   16
mumbai avg_package    0    0    0    0    0    0    0    0
       students       0    0    0    0    0    0    0    0

In [86]:
branch_df3

               delhi               mumbai
         avg_package students avg_package students
cse 2019           1        2           0        0
    2020           3        4           0        0
    2021           5        6           0        0
    2022           7        8           0        0
ece 2019           9       10           0        0
    2020          11       12           0        0
    2021          13       14           0        0
    2022          15       16           0        0

In [89]:
branch_df3.swaplevel(axis=0)

               delhi               mumbai
         avg_package students avg_package students
2019 cse           1        2           0        0
2020 cse           3        4           0        0
2021 cse           5        6           0        0
2022 cse           7        8           0        0
2019 ece           9       10           0        0
2020 ece          11       12           0        0
2021 ece          13       14           0        0
2022 ece          15       16           0        0

In [91]:
pd.DataFrame({'cse':[120]})

   cse
0  120

In [92]:
pd.DataFrame({'cse':[120]}).melt()

  variable  value
0      cse    120

In [93]:

import pandas as pd

# creating a dataframe
df = pd.DataFrame({'Name': {0: 'John', 1: 'Bob', 2: 'Shiela'},
				'Course': {0: 'Masters', 1: 'Graduate', 2: 'Graduate'},
				'Age': {0: 27, 1: 23, 2: 21}})
df

     Name    Course  Age
0    John   Masters   27
1     Bob  Graduate   23
2  Shiela  Graduate   21

In [96]:
pd.melt(df)

  variable     value
0     Name      John
1     Name       Bob
2     Name    Shiela
3   Course   Masters
4   Course  Graduate
5   Course  Graduate
6      Age        27
7      Age        23
8      Age        21

In [95]:
pd.melt(df,id_vars=['Name'],value_vars=['Course'])

     Name variable     value
0    John   Course   Masters
1     Bob   Course  Graduate
2  Shiela   Course  Graduate

In [97]:
pd.melt(df,id_vars=['Course'],value_vars=['Name'])

     Course variable   value
0   Masters     Name    John
1  Graduate     Name     Bob
2  Graduate     Name  Shiela

In [98]:
df

     Name    Course  Age
0    John   Masters   27
1     Bob  Graduate   23
2  Shiela  Graduate   21

In [103]:
pd.melt(df,id_vars=['Name'],value_vars=['Course','Age'],var_name='ChangeName',value_name='ChangeValName')

     Name ChangeName ChangeValName
0    John     Course       Masters
1     Bob     Course      Graduate
2  Shiela     Course      Graduate
3    John        Age            27
4     Bob        Age            23
5  Shiela        Age            21

In [104]:
pd.melt(df,id_vars=['Name'],value_vars=['Course','Age'],var_name='ChangeName',value_name='ChangeValName',ignore_index=True)

     Name ChangeName ChangeValName
0    John     Course       Masters
1     Bob     Course      Graduate
2  Shiela     Course      Graduate
3    John        Age            27
4     Bob        Age            23
5  Shiela        Age            21

In [105]:
studf = pd.DataFrame({'cse':[120],'ece':[100],'mech':[50]})

In [106]:
studf

   cse  ece  mech
0  120  100    50